employer_id
43
company_id
23
job_title
Backend Engineer
job_type
Full-Time
work_location_type
Work from Home
joining_fee
0
basic_requirements
null
total_experience_required
1
total_experience_max
3
other_job_titles
[]
job_expire_time
7
number_of_candidates_required
1
latitude
null
longitude
null
location
min_salary
30000
max_salary
40000
incentive
0
pay_type
Salary
additional_requirements
["Good Communication","Predictive Analytics"]
is_walkin_interview
0
communication_preference
Whatsapp
degree_specialization
["Graduated","B.Com (Hons.)","Business Analytics"]
job_description
<p>Backend Engineer (General) - 1.5</p>
<p>
</p>
<p>**<br>We are seeking a highly skilled and motivated Backend Engineer to join our dynamic team at Skymore. The successful candidate will be responsible for designing, developing, and maintaining our backend systems, ensuring scalability, reliability, and efficiency.</p>
<h3>Key Responsibilities:</h3>
<ul>
<li>
<p>Design, develop, and maintain high-quality, scalable, and efficient backend systems.</p>
</li>
<li>
<p>Collaborate with the frontend team to integrate services and APIs.</p>
</li>
<li>
<p>Implement and maintain database schema.</p>
</li>
<li>
<p>Write reusable, testable, and efficient code.</p>
</li>
<li>
<p>Participate in code reviews and contribute to the overall improvement of our engineering practices.</p>
</li>
<li>
<p>Debug production issues across services and multiple levels of the stack.</p>
</li>
</ul>
<h3>Qualifications:</h3>
<ul>
<li>
<p>B.Com (Hons.) with a specialization in Business Analytics.</p>
</li>
<li>
<p>Up to 3.5 years of experience in backend engineering.</p>
</li>
<li>
<p>Proficiency in programming languages such as Python, Java, or Ruby.</p>
</li>
<li>
<p>Strong understanding of databases (SQL, NoSQL) and experience with database design.</p>
</li>
<li>
<p>Familiarity with cloud platforms (AWS, Google Cloud, Azure).</p>
</li>
<li>
<p>Excellent problem-solving skills and ability to think algorithmically.</p>
</li>
<li>
<p>Strong communication skills with Intermediate English proficiency.</p>
</li>
</ul>
<h3>Education and Experience:</h3>
<ul>
<li>
<p>Bachelor's degree in Business Analytics or related field.</p>
</li>
<li>
<p>3.5 years of experience in backend engineering, preferably in a tech-focused company.</p>
</li>
<li>
<p>Proven experience in designing, developing, and maintaining scalable backend systems.</p>
</li>
<li>
<p>Strong understanding of modern software development principles.</p>
</li>
<li>
<p>Interested candidates are invited to apply by sending their resume and cover letter to manshu.developer@gmail.com. The interview process will be conducted online. We look forward to your application!</p>
</li>
<li>
<p>We are an equal opportunity employer and value diversity at our company. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status. We welcome applications from all qualified individuals and encourage those from diverse backgrounds to apply.</p>
</li>
</ul>
<p>
</p>
english_level
Intermediate
gender_preference
No Preference
perks
["Health Insurance"]
interview_location
null
contact_email
manshu.developer@gmail.com
contact_phone
7988532993
interview_date
null
interview_time
null
not_email
0
viewed_number
0
industry
department
job_role
Technical Support Engineer
compensation
0